[
  {
    "name": "Jane Tungka",
    "role": "ITAR Consultant",
    "department": "Legal",
    "start_date": "2025-09-22",
    "photo": "https://jdi-it.github.io/Guru/images/jane-t.png",
    "intro": "With over 17 years of experience in global trade compliance, Jane brings a wealth of knowledge from her previous role as a Trade Compliance Advisor III Expert at ExxonMobil."
  },
  {
    "name": "Natalia Sarnatska",
    "role": "Accounting Consultant",
    "department": "Finance",
    "start_date": "2025-10-20",
    "photo": "https://jdi-it.github.io/Guru/images/natalia-s.png",
    "intro": "Natalia will be working closely with our in-house accountant in Ukraine and global teams on accounting, financial reporting, and compliance processes."
  },
  {
    "name": "Iryna Hana",
    "role": "Chief Accountant",
    "department": "Finance",
    "start_date": "2025-11-03",
    "photo": "https://jdi-it.github.io/Guru/images/iryna-h.png",
    "intro": "Iryna Hana is JDI’s Ukraine Chief Accountant, bringing over 18 years of experience in accounting and financial management. She oversees our Ukraine-based financial operations, supports accurate and compliant reporting, and helps ensure our accounting processes run smoothly behind the scenes."
  },
  {
    "name": "Jason Medero",
    "role": "Head of IT and Cybersecurity Officer",
    "department": "IT",
    "start_date": "2025-11-10",
    "photo": "https://jdi-it.github.io/Guru/images/jason-m.png",
    "intro": "With more than 20 years of experience across IT operations, security governance, and audit-ready compliance, he leads our IT systems administration, strengthens JDI’s compliance posture, and champions clear, practical, and collaborative approaches to technology and security."
  },
  {
    "name": "Alay Bangash",
    "role": "Dynamics 365 Developer",
    "department": "IT",
    "start_date": "2025-11-24",
    "photo": "",
    "intro": "Alay Bangash is JDI’s Dynamics 365 CRM Developer, bringing 8 years of experience designing, customizing, and integrating Dynamics 365 solutions across Sales, Service, and Marketing. He plays a key role in guiding JDI’s migration to Dynamics 365 CRM, modernizing workflows, improving data quality, and building a scalable, insight-driven CRM platform that supports our long-term growth."
  },
  {
    "name": "Jason Kovan",
    "role": "General Counsel",
    "department": "Legal",
    "start_date": "2026-1-1",
    "photo": "https://jdi-it.github.io/Guru/images/jason-k.png",
    "intro": "Jason Kovan is JDI’s General Counsel, bringing deep experience in tax law, accounting, and international business. He leads JDI’s legal function as we scale, providing oversight across corporate, regulatory, and international matters to support the company’s continued growth and increasingly complex operations."
  },
  {
    "name": "Nathaniel Muhler",
    "role": "Architect",
    "department": "Enklave",
    "start_date": "2026-1-1",
    "photo": "https://jdi-it.github.io/Guru/images/nathaniel-m.png",
    "intro": "Nathaniel Muhler is JDI’s Lead Architect, bringing deep experience leading architectural strategy from concept through execution. He supports JDI’s growth by shaping and scaling SCIF manufacturing capabilities for Enklave, while also contributing to modular and container-based design efforts across the organization."
  },
  {
    "name": "Dhara Shah",
    "role": "Financial Controller",
    "department": "Finance",
    "start_date": "2025-11-1",
    "photo": "https://jdi-it.github.io/Guru/images/dhara-s.png",
    "intro": "Dhara Shah is JDI’s Financial Controller, bringing strong experience in financial reporting and accounting oversight. She supports JDI’s operations by ensuring accurate financial statements, overseeing Accounts Payable, and aligning accounting data with key financial inputs and internal controls across the organization."
  }
]
