[
  {
    "name": "Finance Team",
    "message": "<b>Richard Starkey</b> & <b>Louis Atouguia</b> Big props for the energy and traction you’ve built with our funding partners. The relationships you’re developing are helping chart the next leg of our journey and giving the rest of us plenty to be optimistic about.",
    "photo": "",
    "date": "2025-10-18",
    "department": "Finance"
  },
  {
    "name": "Recruitment Team",
    "message": "<b>Ihor Kazmin</b> & <b>Dane Miller</b> Recruiting legal and accounting roles in Ukraine isn’t for the faint of heart, but you’ve both shown grit and focus in filling our critical roles in Ukraine. Those hires will be huge wins for us as we build out these teams and your persistence is making a real impact.",
    "photo": "",
    "date": "2025-10-18",
    "department": "Recruitment"
  },
  {
    "name": "Stephanie Gaskins",
    "message": "You somehow managed to provide support to the compliance team while representing us at AUSA...and you did it all with your trademark calm and precision. You’ve been a rock for your team and a great example of what “owning it” looks like.",
    "photo": "https://jdi-it.github.io/Guru/images/stephanie-g.png",
    "date": "2025-10-18",
    "department": "Sales"
  },
  {
    "name": "Viktor Irchak",
    "message": "Your leadership on our biggest project yet has been incredible to watch. You’ve kept the team inspired, focused, and moving in sync, even through the tough stretches. We’re lucky to have you steering this ship. Looking forward to our official kick off team meeting coming soon!",
    "photo": "https://jdi-it.github.io/Guru/images/viktor-i.png",
    "date": "2025-10-18",
    "department": "Production"
  },
  {
    "name": "Legal Team",
    "message": "<b>Faizan Peshimam</b> & <b>Oksana Cherniienko</b> You two have been absolute powerhouses this week. The long days reviewing documents and tackling challenges on the modular project didn’t go unnoticed. Your teamwork and commitment kept things moving...thank you both for being steady anchors through the chaos.",
    "photo": "",
    "date": "2025-10-18",
    "department": "Legal"
  },
  {
    "name": "Unmanned Systems Department",
    "message": "Seoul ADEX 2025 - While <b>Jordan Krulik</b> focused on identifying Unmanned Systems solution partners in the US, <b>Vlad Konov</b> traveled to Seoul, South Korea to attend ADEX 2025 to do the same on the other side of the globe.",
    "photo": "",
    "date": "2025-10-25",
    "department": "Unmanned Systems"
  },
  {
    "name": "Sales Department",
    "message": "AUSA 2025 - Last week, <b>Patrick Becker, Stephanie Gaskins, Hilary Warren, Steven Snakebite Kendrick, and Jordan Krulik</b> traveled to Washington, D.C. to the AUSA Annual Convention.  This is an annual conference hosted by the US Army, but widely attended by all US Military and Federal Defense organizations, as well as delegates from a wide variety of foreign allied governments and militaries, and features 1000+ exhibiting companies.  It's one of the largest and most valuable defense events that takes place each year.  The sales team spent 2 1/2 days traversing the massive trade show floor to conduct strategic meetings with current and prospective customers, as well as identify new vendor partners.",
    "photo": "",
    "date": "2025-10-25",
    "department": "Sales"
  },
   {
    "name": "Sales Department",
    "message": "<b>Patrick Becker, Stephanie Gaskins, Elizabeth Herrell, and Mike Eyre:</b> Our sales organization and US-based team met for an offsite in Virginia Beach to align on wins, sharpen our processes, and lock in strategy heading into 2026. Their initiative, planning, and leadership made the event a huge success, bringing people together, strengthening our culture, and building momentum for the year ahead.",
    "photo": "",
    "date": "2025-11-22",
    "department": "Sales"
  },
  {
    "name": "Stephanie Gaskins",
    "message": "A special thank you to <b>Stephanie Gaskins</b> for all of the efforts behind the scenes to set everyone up for a successful offsite.  On top of everything you do every day, you single-handedly ensured every aspect of this event went off smoothly, from booking venue, lodging and food, to IT and managing the presentations, and everything in between, you absolutely blew it out of the water and we greatly appreciate it!.",
    "photo": "https://jdi-it.github.io/Guru/images/stephanie-g.png",
    "date": "2025-11-22",
    "department": "Sales"
  },
  {
    "name": "Sales Department",
    "message": "<b>Patrick Becker, Stephanie Gaskins, Elizabeth Herrell, Steve Peters, Jane Tungka, Jordan Krulik, Steven Kendrick, and Wes Merson:</b> It was very apparent from the slides, presentations, and great Q&A sessions/discussions throughout both days that you each took great care in preparing in advance and setting the team up to leave this week with all of the information and guidance they need to support each other's priorities, protect JDI in the short and long term, and drive JDI toward our goals like a rocket ship heading into 2026.",
    "photo": "https://jdi-it.github.io/Guru/images/sales-department.jpeg",
    "date": "2025-11-22",
    "department": "Sales"
  },
  {
    "name": "Executive Department",
    "message": "I would like to thank <b>James Kerrick</b> or setting the strategic direction and allowing us to spend the time and money necessary to facilitate this great event.  It's not cheap and we all collectively stepped away from our normal roles for the better part of a week, but the alignment and momentum it generated was well worth it.",
    "photo": "https://jdi-it.github.io/Guru/images/james-k.png",
    "date": "2025-11-22",
    "department": "Executive"
  },
  {
    "name": "Sales Department",
    "message": "<b>Elizabeth Herrell<b> and <b>Manoj Weerasekara<b> and their proposal team colleagues have put JDI back on the map with UESF, securing over $2.1M in sales after a long period of uncertainty following USAID’s dissolution. While we’ve seen other operations retreat in this difficult marketplace since then, JDI remains not only standing, but advancing. Against all odds, our Proposal Team continues to diversify our business and elevate our value proposition. Since USAID’s dissolution, the UESF tender process transitioned from an American lead process to a more complex European lead process, putting us at a major disadvantage having to adapt to unfamiliar proposal requirements. Rather than being discouraged by setbacks over the last year, they took each iteration as an opportunity to improve and continued to compete aggressively. The result - they now win decisively. Today, their team has JDI shortlisted now on more than $9M in additional awards. We continue to distinguish this organization as a defender of Ukrainian sovereignty and an indispensable resource for energy resilience, ballistic protection, and anything else we are called upon to manifest in chaotic environments.",
    "photo": "",
    "date": "2025-12-20",
    "department": "Sales"
  },
  {
    "name": "Business Administration Department",
    "message": "<b>Viktor Irchak<b> and <b>Mike Eyre<b> continue to demonstrate they are exemplary leaders who can be counted on to deliver results under any circumstances. Both men have been lynchpins in the F16 ballistic protection project which has been extraordinarily complex in every conceivable way. While Viktor has held our front in Ukraine, Mike has had to cover flanks dealing with the prime vendor and the US Air Force. These guys have had to balance no less than seven agencies from two countries, a revolving door of confused stakeholders, constantly evolving legal requirements, supply chain challenges, liquidity crunches, conflicting narratives, counterintelligence threats, and even sabotage. Come hell or high water, they have at last delivered everyone to the point of contract performance. We are finally beginning work and will be getting our desperately needed solutions into the warfighters hands in the coming months thanks to their unwavering composure and grit. Through their optimism, professionalism, and absolute refusal to surrender, these Jedi and all who have supported them uphold and enhance the highest traditions of Jedi service. Please join me in thanking them, and have a great weekend everyone.",
    "photo": "",
    "date": "2025-12-20",
    "department": "Business Administration"
  },
    {
    "name": "Proposal Department",
    "message": "<b>Liz, Manoj, and the Proposal Team:</b> Victory under pressure. When USAID collapsed and their pipeline disappeared, this team fought back, securing a new pipeline with $5.8M in wins and closing on more. When some wondered what the proposal team would do without USAID, Liz and Manoj answered through action — their team will continue to win.",
    "photo": "",
    "date": "2026-01-01",
    "department": "Proposal"
  },
    {
    "name": "Michael Eyre",
    "message": "<b>Mike</b> (Shelters + Sales): Kept the shelters program moving through constant uncertainty and challenge. <b>Mike</b> managed this while simultaneously building out a sales department that’s already setting us up for another record year in 2026.",
    "photo": "https://jdi-it.github.io/Guru/images/michael-e.png",
    "date": "2026-01-01",
    "department": "Revenue Generation"
  },
      {
    "name": "Viktor Irchak",
    "message": "<b>Viktor</b> (Shelters + Sales): Kept the shelters program moving through constant uncertainty and challenge. <b>Viktor</b> accomplished this while being bombed with his colleagues on an almost nightly basis. These Jedi are steady, aligned, and indispensable.",
    "photo": "https://jdi-it.github.io/Guru/images/viktor-i.png",
    "date": "2026-01-01",
    "department": "Project Management"
  }
]
